<div class=slide>
  <div class=body>
    <center><h1>Preliminaties</h1></center>
    <center>Haskell platform:<br>compiler (GHC) and libraries.</center>
    <br>
    <center>GHCi: interactive environment (REPL).</center>
  </div>
</div>

<div class=slide>
  <div class=body>
    <center><h1>Preliminaties</h1></center>
    <center>Start GHCi:</center>
    <pre class=shell style="font-size: 26px; line-height: 42px;width: 800px">
> ghci
GHCi, version 7.6.1: http://www.haskell.org/ghc/  :? for help
Loading package ghc-prim ... linking ... done.
Loading package integer-gmp ... linking ... done.
Loading package base ... linking ... done.
Prelude></pre>
    <hr>
    <center>Supports command line editing (readline).</center>
  </div>
</div>

<div class=slide>
  <div class=body>
    <center><h1>Numbers</h1></center>
    <pre language=haskell data-geom=50,300>
> > 1
> 1
> > 1 + 1
> 2
> > 2 * (3.1 - 1)
> 4.2
    </pre>
      <center>Also: <code>(-)</code>, <code>div</code>, <code>mod</code>, <code>(/)</code>, &hellip;</center>
      <hr>
      <center>Q: what is 56088 divided by 456?</center>
  </div>
</div>

<div class=slide>
  <div class=body>
    <center><h1>Bindings</h1></center>
    <pre language=haskell data-geom=50,230>
> > let x = 1
> > x + x
> 2
    </pre>
    <hr>
    <center>GHCi only; In a file, just use <code>x = 1</code>.</center>
    <hr>
    <center>Non-mutable; Re-binding shadows.</center>
  </div>
</div>

<div class=slide>
  <div class=body>
    <center><h1>Files</h1></center>
    <pre language=haskell data-geom=60,200>
> x = 1
> y = x + 2
    </pre>
    <center data-geom=80>
      <p>Save this with extension <code>.hs</code>.</p>
      <p>Load in GHCi with <code>ghci &lt;filename&gt;</code></p>
      <p>Reload with <code>:r</code></p>
    </center>
  </div>
</div>

<div class=slide>
  <div class=body>
    <center><h1>Booleans</h1></center>
    <pre language=haskell data-geom=80,520>
> > True
> True
> > not True
> False
> > True && (False || True)
> True
    </pre>
  </div>
</div>

<div class=slide>
  <div class=body>
    <center><h1>Application</h1></center>
    <pre language=haskell data-geom=,220>
> > not True
> False
    </pre>
    <center>Application with space.</center>
    <hr>
    <pre language=haskell data-geom=,180>
> > min 1 2
> 1
    </pre>
    <center>Multiple arguments with another space.</center>
  </div>
</div>

<div class=slide>
  <div class=body>
    <center><h1>If-then-else</h1></center>
    <pre language=haskell data-geom=80,460>
> > if True then 1 else 2
> 1
    </pre>
    <center data-geom=80>
      <p>This is an <em>expression</em>:<br>you cannot leave out a branch.</p>
      <p>C.f. ternary operator.</p>
    </center>
  </div>
</div>

<div class=slide>
  <div class=body>
    <center><h1>Types</h1></center>
    <pre language=haskell data-geom=60,380>
> > :t True
> True :: Bool
> > :t not
> not :: Bool -> Bool
    </pre>
    <hr>
    <center data-geom=80>
      <p>Q: What is the type of <code>(&&)</code>?</p>
      <p>Bonus: Look at the type of <code>(+)</code>.</p>
    </center>
  </div>
</div>

<div class=slide>
  <div class=body>
    <center><h1>Type errors</h1></center>
    <pre language=haskell data-geom=,790>
> > if not then True else False
    </pre>
    <pre language=haskell data-geom=,790>
> &lt;interactive&gt;:1:4:
>     Couldn't match expected type `Bool'
>       with actual type `Bool -> Bool'
>     In the expression: not
>     In the expression:
>       if not then True else False
</pre>
  </div>
</div>

<div class=slide>
  <div class=body>
    <center><h1>Type classes</h1></center>
    <pre language=haskell data-geom=80,300>
> > :t 1
> 1 :: Num a => a
    </pre>
    <hr>
    <center data-geom=80>
      <p><code>Num</code> is a <em>type class</em>.</p>
      <p>Says: <code>1</code> can be any type that is numeric.</p>
      <hr>
      <p>Q: Explain the type of (+).</p>
    </center>
  </div>
</div>

<div class=slide>
  <div class=body>
    <center><h1>Type class errors</h1></center>
    <pre language=haskell data-geom=,200>
> > 1 + True
    </pre>
    <pre language=haskell>
> &lt;interactive&gt;:25:3:
>     No instance for (Num Bool) arising from
>       a use of `+'
>     Possible fix: add an instance declaration
>       for (Num Bool)
>     In the expression: 1 + True
>     In an equation for `it': it =
    </pre>
  </div>
</div>

<div class=slide>
  <div class=body>
    <center><h1>Number types</h1></center>
    <table data-geom=80,660 style="margin: 80px auto">
    <tr><td>Integral:</td> <td><code>Integer, Int</code></td></tr>
    <tr><td>Floating:</td> <td><code>Double, Float</code></td></tr>
    <tr><td>Fractional:</td> <td><code>Rational</code></td></tr>
    <tr><td>Fixed size:</td> <td><code style="font-size: 80%">Int8 ... Int64,<br> Word8 ... Word64</code></td></tr>
    </table>
  </div>
</div>

<div class=slide>
  <div class=body>
    <center><h1>Characters and strings</h1></center>
    <pre language=haskell data-geom=80,470>
> > :t 'c'
> 'c' :: Char
> > :t "Hello world"
> "Hello World" :: String
> > "FP" ++ "days"
> "FPdays"
    </pre>
    <hr>
    <center>Q: What is the type of "Hello World" really?</center>
  </div>
</div>

<div class=slide>
  <div class=body>
    <center><h1>Lists</h1></center>
    <pre language=haskell data-geom=,600>
> > :t [True, True, False]
> [True, True, False] :: [Bool]
> > :t []
> [] :: [a]
> > 1 : [2,3]
> [1,2,3]
> > [1,2,3] ++ [4,5,6]
> [1,2,3,4,5,6]
    </pre>
    <hr>
    <center>Q: Try to make a list<br> containing one, two and false.</center>
  </div>
</div>

<div class=slide>
  <div class=body>
    <center><h1>List functions</h1></center>
    <pre language=haskell data-geom=,320>
> > length [1,4,7]
> 3
    </pre>
    <hr>
    <pre language=haskell data-geom=,320>
> > take 3 [1..10]
> [1,2,3]
    </pre>
    <hr>
    <pre language=haskell data-geom=,360>
> > drop 3 [10,9..1]
> [7,6,5,4,3,2,1]
    </pre>
  </div>
</div>

<div class=slide>
  <div class=body>
    <center><h1>List functions - 2</h1></center>
    <pre language=haskell data-geom=,300>
> > head [4,5,6]
> 4
    </pre>
    <hr>
    <pre language=haskell data-geom=,300>
> > tail [4,5,6]
> [5,6]
    </pre>
    <hr>
    <pre language=haskell data-geom=,330>
> > elem 3 [1,2,4]
> False
    </pre>
  </div>
</div>

<div class=slide>
  <div class=body>
    <center><h1>Infinite lists</h1></center>
    <pre language=haskell data-geom=,240>
> > head [1..]
> 1
    </pre>
    <hr>
    <pre language=haskell data-geom=,510>
> > take 10 (cycle [1,2,3])
> [1,2,3,1,2,3,1,2,3,1]
    </pre>
    <hr>
    <pre language=haskell data-geom=,490>
> > head (tail (repeat 2))
> 2
    </pre>
  </div>
</div>

<div class=slide>
  <div class=body>
    <center><h1>Equality</h1></center>
    <pre language=haskell data-geom=100,400>
> > 1 == 1
> True
> > [1,2,3] /= [1,2,4]
> True
    </pre>
    <hr>
    <center>
    <p>Works on most types.</p>
    <p>Q: what is the type of <code>(==)</code>?</p>
    </center>
  </div>
</div>

<div class=slide>
  <div class=body>
    <center><h1>Comparison</h1></center>
    <pre language=haskell data-geom=,400>
> > 1 > 2
> False
> > [1,2,3] < [1,2,4]
> True
    </pre>
    <center>Also <code>(&lt;=), (&gt;=)</code>.</center>
    <hr>
    <pre language=haskell data-geom=,610>
> > :t (<)
> (<) :: Ord a => a -> a -> Bool
    </pre>
  </div>
</div>
